app/controllers/home_controller.rb

SELECT * FROM `pin_items` WHERE (user_id = 2) ORDER BY created_at desc
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT `comments`.* FROM `comments` WHERE (`comments`.pin_item_id IN (7,6,5,4,3,2,1))
SELECT * FROM `pin_items` ORDER BY created_at desc
SELECT count(DISTINCT `comments`.id) AS count_all FROM `comments` LEFT OUTER JOIN `users` ON `users`.id = `comments`.user_id WHERE (`comments`.pin_item_id = 1)
---
  def index
    if session[:signed_request] or params[:signed_request]
      begin
        if session[:signed_request]
          params[:signed_request] = session[:signed_request]
        end
        # render :text => params.inspect and return false
        signed_request = parse_signed_request(params, FB_APP_KEY)
        if signed_request["user_id"] and current_user and current_user.uid == signed_request["user_id"].to_i
          session[:signed_request] = params[:signed_request]
        else
          redirect_to callback_path
        end
      rescue => e
        render :text => e.message.inspect and return false
        # redirect_to callback_path and return
      end
    end

      user_id = params[:user_id]
      query = ((user_id.to_i > 0) ? "user_id = #{user_id}" : nil)

      @pin_images = PinItem.find(:all,:conditions => ["#{query}"],:include => [:comments, :user],:order => "created_at desc")
      if current_user
        redirect_to addpin_path and return if @pin_images.empty?

SELECT * FROM `pin_items` WHERE (description like '%shirt%') ORDER BY created_at desc
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
SELECT `comments`.* FROM `comments` WHERE (`comments`.pin_item_id IN (3,2,1))
---
  def search
    @search = params[:search]
    if @search.empty?
      redirect_to root_path
      return
    end
    @pin_images = PinItem.find(:all,:conditions => ["description like ?","%#{@search}%"],:include => [:comments, :user],:order => "created_at desc")

SELECT * FROM `user_points` WHERE (point_type in (1,1)) AND (`user_points`.user_id = 1)
SELECT * FROM `users`
---
  def winners
    @users = User.all.sort! { |u1, u2| u2.points <=> u1.points}