app/controllers/pin_items_controller.rb

  def add_pin_item
    @pin_item = PinItem.new(params[:pin_image])
    @pin_item.image_remote_url = params[:image_url]
    @pin_item.user_id = current_user.id
    @pin_item.save!
---
INSERT INTO `pin_items` (`created_at`, `image_url`, `updated_at`, `pin_type`, `user_id`, `description`) VALUES('2012-06-20 06:55:07', '22kgoldchain_18062012.jpg', '2012-06-20 06:55:07', 1, 2, 'rakhi')

  def effects
    @pin_item = PinItem.find(params[:id])
---
SELECT * FROM `pin_items` WHERE (`pin_items`.`id` = 1)

  def comment
    @pin_item = PinItem.find(params[:id])
    comment = params[:comment]
    if comment
      @comment = current_user.comments.new(:pin_item_id => @pin_item.id, :comment => comment.strip)
      if @comment.valid?
        @comment.save
---
SELECT * FROM `pin_items` WHERE (`pin_items`.`id` = 1)
INSERT INTO `comments` (`comment`, `created_at`, `updated_at`, `user_id`, `pin_item_id`) VALUES('good one', '2012-06-20 09:05:32', '2012-06-20 09:05:32', 2, 4)

  def show
    @pin_item = PinItem.find(params[:id])
---
SELECT * FROM `pin_items` WHERE (`pin_items`.`id` = 1)

  def set_like
#    pin_item = PinItem.find(params[:id])
    pin_item_id = params[:id]

    user_point = UserPoint.new(:user_id => current_user.id,:pin_item_id => pin_item_id)
    user_point.point_type = UserPoint::POINT_TYPES[:like][:type]
    user_point.points = UserPoint::POINT_TYPES[:like][:points]
    user_point.save
---
INSERT INTO `pin_items` (`created_at`, `image_url`, `updated_at`, `pin_type`, `user_id`, `description`) VALUES('2012-06-20 08:39:42', 'edges_1.jpg', '2012-06-20 08:39:42', 3, 2, 'sale...sale...sale')
INSERT INTO `user_points` (`point_type`, `created_at`, `updated_at`, `points`, `user_id`, `pin_item_id`) VALUES(5, '2012-06-20 08:48:38', '2012-06-20 08:48:38', -10, 2, 1)

  def apply_effect
#    render :text => params.inspect and return false
    pin_item = PinItem.find(params[:id])
---
SELECT * FROM `pin_items` WHERE (`pin_items`.`id` = 1)