app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`email` = 'mailtoankitparekh@gmail.com') LIMIT 1
INSERT INTO `users` (`name`, `secret_token`, `created_at`, `image_url`, `updated_at`, `uid`, `remember_token`, `email`, `provider`) VALUES(NULL, NULL, '2012-07-21 10:14:11', '/images/default_pic.jpeg', '2012-07-21 10:14:11', NULL, NULL, 'ankit@dealkat.com', NULL)
---
  def login
    if params[:user]
      email = params[:user][:email]
      if email.nil? or email.blank?
        flash[:error] = "Hey, please enter valid email"
        return
      end
      user = User.find_or_create_by_email(email)

SELECT * FROM `users` WHERE (`users`.`provider` = 'facebook' AND `users`.`uid` = '1460294948') LIMIT 1
---
  def callback
    if params[:code]
      url = "https://graph.facebook.com/oauth/access_token?client_id=#{FB_APP_ID}&redirect_uri=#{callback_url}&client_secret=#{FB_APP_KEY}&code=#{params[:code]}"
      data = open(url).read
      redirect_to :action => "failure" and return if data.nil? or data.blank?

      token = data.split("&")[0].gsub("access_token=", "")
      fb_info = User.fb_omni(token)

      user = User.find_or_initialize_by_provider_and_uid("facebook", fb_info.identifier)

SELECT * FROM `users` WHERE (`users`.`uid` = '1066634600' AND `users`.`provider` = 'facebook') LIMIT 1
UPDATE `users` SET `updated_at` = '2012-06-20 10:20:20', `image_url` = NULL WHERE `id` = 4
---
  def create
    auth = request.env["rack.auth"]
#    render :text => auth.inspect and return false
    user = User.find_or_initialize_by_provider_and_uid(auth['provider'], auth['uid'])
    fb_info = User.fb_omni(auth['credentials']['token'])
    user.name = fb_info.name
    user.image_url= fb_info.picture
    if auth['credentials']
      user.remember_token = auth['credentials']['token']
      user.secret_token = auth['credentials']['secret']
    end
    user.save